Tekla Open API Reference for Tekla Structures 2025
AABB.IsInside Method (Point)
 Checks if the given point is inside the current axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsInside(
	Point Point
)
Public Function IsInside (
	Point As Point
) As Boolean
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be checked.
Return Value
Type: Boolean
True if the point is inside the current axis-aligned 3d bounding box.
See Also
Reference
AABB Class
IsInside Overload
Tekla.Structures.Geometry3d Namespace